# GetPipeSettings Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipeSettings..::..GetPipeSettings Method
PipeSettings Class See Also
---
Get the pipe settings of the project.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public static PipeSettings GetPipeSettings(
	Document document
)
```

Visual Basic
---
```text
Public Shared Function GetPipeSettings ( _
	document As Document _
) As PipeSettings
```

Visual C++
---
```text
public:
static PipeSettings^ GetPipeSettings(
	Document^ document
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document.
# ### Return Value
The pipe settings of the project.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
PipeSettings Class
Autodesk.Revit.DB.Plumbing Namespace